; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v5 - type_3 ?v4 - type_2)
 	      (pred_4 ?v8 - object ?v4 - type_2)
	      (pred_3 ?v5 - type_3 ?v7 - type_1)
	      (pred_1 ?v5 - type_3 ?v8 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v5 - type_3 ?v6 ?v3 - type_2)
       :precondition (and  (pred_2 ?v5 ?v6))
       :effect (and  (pred_2 ?v5 ?v3)
		     (not (pred_2 ?v5 ?v6))))

   (:action op_2
       :parameters (?v5 - type_3 ?v2 - object ?v1 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v2 ?v1) (pred_2 ?v5 ?v1) (pred_3 ?v5 ?v7))
       :effect (and (pred_1 ?v5 ?v2 ?v7)
		    (not (pred_4 ?v2 ?v1)) 
		    (not (pred_3 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_3 ?v2 - object ?v1 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v2 ?v7) (pred_2 ?v5 ?v1))
       :effect (and (pred_4 ?v2 ?v1)
		    (pred_3 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_08 - type_3
obj_01 obj_12 obj_13 obj_06 - type_1
obj_07 obj_11 obj_10 obj_03 - type_2
obj_09 obj_04 obj_02 - object)
(:init
(pred_2 obj_05 obj_10)
(pred_3 obj_05 obj_01)
(pred_3 obj_05 obj_12)
(pred_2 obj_08 obj_11)
(pred_3 obj_08 obj_13)
(pred_3 obj_08 obj_06)
(pred_4 obj_09 obj_11)
(pred_4 obj_04 obj_10)
(pred_4 obj_02 obj_11)
)
(:goal
(and
(pred_4 obj_09 obj_10)
(pred_4 obj_04 obj_07)
(pred_4 obj_02 obj_11)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_10) (pred_2 obj_08 obj_10))))
  )
)
)

; plan
1. (op_2 obj_08 obj_09 obj_11 obj_06)
   deleted: (pred_4 obj_09 obj_11) (pred_3 obj_08 obj_06)
   added: (pred_1 obj_08 obj_09 obj_06)
   goals met: 1 of 3
2. (op_2 obj_05 obj_04 obj_10 obj_12)
   deleted: (pred_4 obj_04 obj_10) (pred_3 obj_05 obj_12)
   added: (pred_1 obj_05 obj_04 obj_12)
   goals met: 1 of 3
3. (op_1 obj_05 obj_10 obj_07)
   deleted: (pred_2 obj_05 obj_10)
   added: (pred_2 obj_05 obj_07)
   goals met: 1 of 3
4. (op_1 obj_08 obj_11 obj_10)
   deleted: (pred_2 obj_08 obj_11)
   added: (pred_2 obj_08 obj_10)
   goals met: 1 of 3
5. (op_3 obj_08 obj_09 obj_10 obj_06)
   deleted: (pred_1 obj_08 obj_09 obj_06)
   added: (pred_4 obj_09 obj_10) (pred_3 obj_08 obj_06)
   goals met: 2 of 3
6. (op_3 obj_05 obj_04 obj_07 obj_12)
   deleted: (pred_1 obj_05 obj_04 obj_12)
   added: (pred_4 obj_04 obj_07) (pred_3 obj_05 obj_12)
   goals met: 3 of 3
